GopalSaraf/Practicals/PSDL/include/proc/pic18f04q40.inc
// Register: RC0I2C
#define RC0I2C RC0I2C
RC0I2C                                   equ 0289h
// bitfield definitions
RC0I2C_TH_POSN                           equ 0000h
RC0I2C_TH_POSITION                       equ 0000h
RC0I2C_TH_SIZE                           equ 0002h
RC0I2C_TH_LENGTH                         equ 0002h
RC0I2C_TH_MASK                           equ 0003h
RC0I2C_PU_POSN                           equ 0004h
RC0I2C_PU_POSITION                       equ 0004h
RC0I2C_PU_SIZE                           equ 0002h
RC0I2C_PU_LENGTH                         equ 0002h
RC0I2C_PU_MASK                           equ 0030h
RC0I2C_SLEW_POSN                         equ 0006h
RC0I2C_SLEW_POSITION                     equ 0006h
RC0I2C_SLEW_SIZE                         equ 0002h
RC0I2C_SLEW_LENGTH                       equ 0002h
RC0I2C_SLEW_MASK                         equ 00C0h
RC0I2C_TH0_POSN                          equ 0000h
RC0I2C_TH0_POSITION                      equ 0000h
RC0I2C_TH0_SIZE                          equ 0001h
RC0I2C_TH0_LENGTH                        equ 0001h
RC0I2C_TH0_MASK                          equ 0001h
RC0I2C_TH1_POSN                          equ 0001h
RC0I2C_TH1_POSITION                      equ 0001h
RC0I2C_TH1_SIZE                          equ 0001h
RC0I2C_TH1_LENGTH                        equ 0001h
RC0I2C_TH1_MASK                          equ 0002h
RC0I2C_PU0_POSN                          equ 0004h
RC0I2C_PU0_POSITION                      equ 0004h
RC0I2C_PU0_SIZE                          equ 0001h
RC0I2C_PU0_LENGTH                        equ 0001h
RC0I2C_PU0_MASK                          equ 0010h
RC0I2C_PU1_POSN                          equ 0005h
RC0I2C_PU1_POSITION                      equ 0005h
RC0I2C_PU1_SIZE                          equ 0001h
RC0I2C_PU1_LENGTH                        equ 0001h
RC0I2C_PU1_MASK                          equ 0020h
RC0I2C_SLEW0_POSN                        equ 0006h
RC0I2C_SLEW0_POSITION                    equ 0006h
RC0I2C_SLEW0_SIZE                        equ 0001h
RC0I2C_SLEW0_LENGTH                      equ 0001h
RC0I2C_SLEW0_MASK                        equ 0040h
RC0I2C_SLEW1_POSN                        equ 0007h
RC0I2C_SLEW1_POSITION                    equ 0007h
RC0I2C_SLEW1_SIZE                        equ 0001h
RC0I2C_SLEW1_LENGTH                      equ 0001h
RC0I2C_SLEW1_MASK                        equ 0080h
RC0I2C_I2CTH_POSN                        equ 0000h
RC0I2C_I2CTH_POSITION                    equ 0000h
RC0I2C_I2CTH_SIZE                        equ 0002h
RC0I2C_I2CTH_LENGTH                      equ 0002h
RC0I2C_I2CTH_MASK                        equ 0003h
RC0I2C_I2CPU_POSN                        equ 0004h
RC0I2C_I2CPU_POSITION                    equ 0004h
RC0I2C_I2CPU_SIZE                        equ 0002h
RC0I2C_I2CPU_LENGTH                      equ 0002h
RC0I2C_I2CPU_MASK                        equ 0030h
RC0I2C_I2CSLEW_POSN                      equ 0006h
RC0I2C_I2CSLEW_POSITION                  equ 0006h
RC0I2C_I2CSLEW_SIZE                      equ 0002h
RC0I2C_I2CSLEW_LENGTH                    equ 0002h
RC0I2C_I2CSLEW_MASK                      equ 00C0h
RC0I2C_I2CTH0_POSN                       equ 0000h
RC0I2C_I2CTH0_POSITION                   equ 0000h
RC0I2C_I2CTH0_SIZE                       equ 0001h
RC0I2C_I2CTH0_LENGTH                     equ 0001h
RC0I2C_I2CTH0_MASK                       equ 0001h
RC0I2C_I2CTH1_POSN                       equ 0001h
RC0I2C_I2CTH1_POSITION                   equ 0001h
RC0I2C_I2CTH1_SIZE                       equ 0001h
RC0I2C_I2CTH1_LENGTH                     equ 0001h
RC0I2C_I2CTH1_MASK                       equ 0002h
RC0I2C_I2CPU0_POSN                       equ 0004h
RC0I2C_I2CPU0_POSITION                   equ 0004h
RC0I2C_I2CPU0_SIZE                       equ 0001h
RC0I2C_I2CPU0_LENGTH                     equ 0001h
RC0I2C_I2CPU0_MASK                       equ 0010h
RC0I2C_I2CPU1_POSN                       equ 0005h
RC0I2C_I2CPU1_POSITION                   equ 0005h
RC0I2C_I2CPU1_SIZE                       equ 0001h
RC0I2C_I2CPU1_LENGTH                     equ 0001h
RC0I2C_I2CPU1_MASK                       equ 0020h
RC0I2C_I2CSLEW0_POSN                     equ 0006h
RC0I2C_I2CSLEW0_POSITION                 equ 0006h
RC0I2C_I2CSLEW0_SIZE                     equ 0001h
RC0I2C_I2CSLEW0_LENGTH                   equ 0001h
RC0I2C_I2CSLEW0_MASK                     equ 0040h
RC0I2C_I2CSLEW1_POSN                     equ 0007h
RC0I2C_I2CSLEW1_POSITION                 equ 0007h
RC0I2C_I2CSLEW1_SIZE                     equ 0001h
RC0I2C_I2CSLEW1_LENGTH                   equ 0001h
RC0I2C_I2CSLEW1_MASK                     equ 0080h

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
I2C1RXB                                  equ 028Ah
// bitfield definitions
I2C1RXB_RXB_POSN                         equ 0000h
I2C1RXB_RXB_POSITION                     equ 0000h
I2C1RXB_RXB_SIZE                         equ 0008h
I2C1RXB_RXB_LENGTH                       equ 0008h
I2C1RXB_RXB_MASK                         equ 00FFh

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
I2C1TXB                                  equ 028Bh
// bitfield definitions
I2C1TXB_TXB_POSN                         equ 0000h
I2C1TXB_TXB_POSITION                     equ 0000h
I2C1TXB_TXB_SIZE                         equ 0008h
I2C1TXB_TXB_LENGTH                       equ 0008h
I2C1TXB_TXB_MASK                         equ 00FFh

// Register: I2C1CNTL
#define I2C1CNTL I2C1CNTL
I2C1CNTL                                 equ 028Ch
// bitfield definitions
I2C1CNTL_CNT_POSN                        equ 0000h
I2C1CNTL_CNT_POSITION                    equ 0000h
I2C1CNTL_CNT_SIZE                        equ 0008h
I2C1CNTL_CNT_LENGTH                      equ 0008h
I2C1CNTL_CNT_MASK                        equ 00FFh
I2C1CNTL_CNT0_POSN                       equ 0000h
I2C1CNTL_CNT0_POSITION                   equ 0000h
I2C1CNTL_CNT0_SIZE                       equ 0001h
I2C1CNTL_CNT0_LENGTH                     equ 0001h
I2C1CNTL_CNT0_MASK                       equ 0001h
I2C1CNTL_CNT1_POSN                       equ 0001h
I2C1CNTL_CNT1_POSITION                   equ 0001h
I2C1CNTL_CNT1_SIZE                       equ 0001h
I2C1CNTL_CNT1_LENGTH                     equ 0001h
I2C1CNTL_CNT1_MASK                       equ 0002h
I2C1CNTL_CNT2_POSN                       equ 0002h
I2C1CNTL_CNT2_POSITION                   equ 0002h
I2C1CNTL_CNT2_SIZE                       equ 0001h
I2C1CNTL_CNT2_LENGTH                     equ 0001h
I2C1CNTL_CNT2_MASK                       equ 0004h
I2C1CNTL_CNT3_POSN                       equ 0003h
I2C1CNTL_CNT3_POSITION                   equ 0003h
I2C1CNTL_CNT3_SIZE                       equ 0001h
I2C1CNTL_CNT3_LENGTH                     equ 0001h
I2C1CNTL_CNT3_MASK                       equ 0008h
I2C1CNTL_CNT4_POSN                       equ 0004h
I2C1CNTL_CNT4_POSITION                   equ 0004h
I2C1CNTL_CNT4_SIZE                       equ 0001h
I2C1CNTL_CNT4_LENGTH                     equ 0001h
I2C1CNTL_CNT4_MASK                       equ 0010h
I2C1CNTL_CNT5_POSN                       equ 0005h
I2C1CNTL_CNT5_POSITION                   equ 0005h
I2C1CNTL_CNT5_SIZE                       equ 0001h
I2C1CNTL_CNT5_LENGTH                     equ 0001h
I2C1CNTL_CNT5_MASK                       equ 0020h
I2C1CNTL_CNT6_POSN                       equ 0006h
I2C1CNTL_CNT6_POSITION                   equ 0006h
I2C1CNTL_CNT6_SIZE                       equ 0001h
I2C1CNTL_CNT6_LENGTH                     equ 0001h
I2C1CNTL_CNT6_MASK                       equ 0040h
I2C1CNTL_CNT7_POSN                       equ 0007h
I2C1CNTL_CNT7_POSITION                   equ 0007h
I2C1CNTL_CNT7_SIZE                       equ 0001h
I2C1CNTL_CNT7_LENGTH                     equ 0001h
I2C1CNTL_CNT7_MASK                       equ 0080h

// Register: I2C1CNTH
#define I2C1CNTH I2C1CNTH
I2C1CNTH                                 equ 028Dh
// bitfield definitions
I2C1CNTH_CNT_POSN                        equ 0000h
I2C1CNTH_CNT_POSITION                    equ 0000h
I2C1CNTH_CNT_SIZE                        equ 0008h
I2C1CNTH_CNT_LENGTH                      equ 0008h
I2C1CNTH_CNT_MASK                        equ 00FFh
I2C1CNTH_CNT8_POSN                       equ 0000h
I2C1CNTH_CNT8_POSITION                   equ 0000h
I2C1CNTH_CNT8_SIZE                       equ 0001h
I2C1CNTH_CNT8_LENGTH                     equ 0001h
I2C1CNTH_CNT8_MASK                       equ 0001h
I2C1CNTH_CNT9_POSN                       equ 0001h
I2C1CNTH_CNT9_POSITION                   equ 0001h
I2C1CNTH_CNT9_SIZE                       equ 0001h
I2C1CNTH_CNT9_LENGTH                     equ 0001h
I2C1CNTH_CNT9_MASK                       equ 0002h
I2C1CNTH_CNT10_POSN                      equ 0002h
I2C1CNTH_CNT10_POSITION                  equ 0002h
I2C1CNTH_CNT10_SIZE                      equ 0001h
I2C1CNTH_CNT10_LENGTH                    equ 0001h
I2C1CNTH_CNT10_MASK                      equ 0004h
I2C1CNTH_CNT11_POSN                      equ 0003h
I2C1CNTH_CNT11_POSITION                  equ 0003h
I2C1CNTH_CNT11_SIZE                      equ 0001h
I2C1CNTH_CNT11_LENGTH                    equ 0001h
I2C1CNTH_CNT11_MASK                      equ 0008h
I2C1CNTH_CNT12_POSN                      equ 0004h
I2C1CNTH_CNT12_POSITION                  equ 0004h
I2C1CNTH_CNT12_SIZE                      equ 0001h
I2C1CNTH_CNT12_LENGTH                    equ 0001h
I2C1CNTH_CNT12_MASK                      equ 0010h
I2C1CNTH_CNT13_POSN                      equ 0005h
I2C1CNTH_CNT13_POSITION                  equ 0005h
I2C1CNTH_CNT13_SIZE                      equ 0001h
I2C1CNTH_CNT13_LENGTH                    equ 0001h
I2C1CNTH_CNT13_MASK                      equ 0020h
I2C1CNTH_CNT14_POSN                      equ 0006h
I2C1CNTH_CNT14_POSITION                  equ 0006h
I2C1CNTH_CNT14_SIZE                      equ 0001h
I2C1CNTH_CNT14_LENGTH                    equ 0001h
I2C1CNTH_CNT14_MASK                      equ 0040h
I2C1CNTH_CNT15_POSN                      equ 0007h
I2C1CNTH_CNT15_POSITION                  equ 0007h
I2C1CNTH_CNT15_SIZE                      equ 0001h
I2C1CNTH_CNT15_LENGTH                    equ 0001h
I2C1CNTH_CNT15_MASK                      equ 0080h

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
I2C1ADB0                                 equ 028Eh
// bitfield definitions
I2C1ADB0_ADB_POSN                        equ 0000h
I2C1ADB0_ADB_POSITION                    equ 0000h
I2C1ADB0_ADB_SIZE                        equ 0008h
I2C1ADB0_ADB_LENGTH                      equ 0008h
I2C1ADB0_ADB_MASK                        equ 00FFh

